Copyright Jana Schaich Borg/Attribution-NonCommercial 4.0 International (CC BY-NC 4.0)

# MySQL Exercise 11: Queries that Test Relationships Between Test Completion and Dog Characteristics

This lesson we are going to integrate all the SQL syntax we've learned so far to start addressing questions in our Dognition Analysis Plan.  I summarized the reasons having an analysis plan is so important in the "Start with an Analysis Plan" video accompanying this week's materials.  Analysis plans ensure that you will address questions that are relevant to your business objectives as quickly and efficiently as possible.  The quickest way to narrow in the factors in your analysis plan that are likely to create new insights is to combine simple SQL calculations with visualization programs, like Tableau, to identify which factors under consideration have the strongest effects on the business metric you are tasked with improving.  You can then design more nuanced statistical models in other software, such as R, based on the factors you have confirmed are likely to be important for understanding and changing your business metric. 

<img src="https://duke.box.com/shared/static/davndrvd4jb1awwuq6sd1rgt0ck4o8nm.jpg" width=400 alt="SELECT FROM WHERE ORDER BY" />

I describe a method for designing analysis plans in the Data Visualization and Communication with Tableau course earlier in this Specialization.  I call that method Structured Pyramid Analysis Plans, or "sPAPs".  I have provided a skeleton of an sPAP for the Dognition data set with the materials for this course that I will use as a road map for the queries we will design and practice in the next two lessons.  To orient you, the SMART goal of the analysis project is at the top of the pyramid.  This is a specific, measurable, attainable, relevant, and time-bound version of the general project objective, which is to make a recommendation to Dognition about what they could do to increase the number of tests customers complete. The variables you will use to assess the goal should be filled out right under where the SMART goal is written.  Then under those variables, you will see ever-widening layers of categories and sub-categories of issues that will be important to analyze in order to achieve your SMART goal.  
   
In this lesson, we will write queries to address the issues in the left-most branch of the sPAP.  These issues all relate to "Features of Dogs" that could potentially influence the number of tests the dogs will ultimately complete.  We will spend a lot of time discussing and practicing how to translate analysis questions described in words into queries written in SQL syntax.

To begin, load the sql library and database, and make the Dognition database your default database:

In [1]:
load_ext sql

In [2]:
sql mysql://studentuser:studentpw@mysqlserver/dognitiondb

'Connected: studentuser@dognitiondb'

In [3]:
sql USE dognitiondb

0 rows affected.

[]

<img src="https://duke.box.com/shared/static/p2eucjdttai08eeo7davbpfgqi3zrew0.jpg" width=600 alt="SELECT FROM WHERE" />

## 1. Assess whether Dognition personality dimensions are related to the number of tests completed 

The first variable in the Dognition sPAP we want to investigate is Dognition personality dimensions.  Recall from the "Meet Your Dognition Data" video and the written description of the Dognition Data Set included with the Week 2 materials that Dognition personality dimensions represent distinct combinations of characteristics assessed by the Dognition tests.  It is certainly plausible that certain personalities of dogs might be more or less likely to complete tests.  For example, "einstein" dogs might be particularly likely to complete a lot of tests.  

To test the relationship between Dognition personality dimensions and test completion totals, we need a query that will output a summary of the number of tests completed by dogs that have each of the Dognition personality dimensions.  The features you will need to include in your query are foreshadowed by key words in this sentence.  First, the fact that you need a summary of the number of tests completed suggests you will need an aggregation function.  Next, the fact that you want a different summary for each personality dimension suggests that you will need a GROUP BY clause.  Third, the fact that you need a "summary of the number of tests completed" rather than just a "summary of the tests completed" suggests that you might have to have multiple stages of aggegrations, which in turn might mean that you will need to use a subquery.

Let's build the query step by step.

**Question 1: To get a feeling for what kind of values exist in the Dognition personality dimension column, write a query that will output all of the distinct values in the dimension column.  Use your relational schema or the course materials to determine what table the dimension column is in.  Your output should have 11 rows.**

In [8]:
sql SELECT DISTINCT dimension FROM dogs

11 rows affected.

[('charmer',),
 ('protodog',),
 (None,),
 ('einstein',),
 ('stargazer',),
 ('maverick',),
 ('socialite',),
 ('ace',),
 ('expert',),
 ('renaissance-dog',),
 ('',)]

The results of the query above illustrate there are NULL values (indicated by the output value "none") in the dimension column.  Keep that in mind in case it is relevant to future queries.  

We want a summary of the total number of tests completed by dogs with each personality dimension.  In order to calculate those summaries, we first need to calculate the total number of tests completed by each dog.  We can achieve this using a subquery.  The subquery will require data from both the dogs and the complete_tests table, so the subquery will need to include a join.  We are only interested in dogs who have completed tests, so an inner join is appropriate in this case.

**Question 2: Use the equijoin syntax (described in MySQL Exercise 8) to write a query that will output the Dognition personality dimension and total number of tests completed by each unique DogID.  This query will be used as an inner subquery in the next question.  LIMIT your output to 100 rows for troubleshooting purposes.**

In [13]:
sql SELECT d.dog_guid,COUNT(c.created_at),d.dimension\
    FROM dogs d JOIN complete_tests c\
        ON d.dog_guid = c.dog_guid\
    GROUP BY d.dog_guid\
    LIMIT 100

100 rows affected.

[('fd27b272-7144-11e5-ba71-058fbc01cf0b', 21, 'charmer'),
 ('fd27b5ba-7144-11e5-ba71-058fbc01cf0b', 20, 'protodog'),
 ('fd27b6b4-7144-11e5-ba71-058fbc01cf0b', 2, None),
 ('fd27b79a-7144-11e5-ba71-058fbc01cf0b', 11, None),
 ('fd27b86c-7144-11e5-ba71-058fbc01cf0b', 31, 'einstein'),
 ('fd27b948-7144-11e5-ba71-058fbc01cf0b', 20, 'stargazer'),
 ('fd27ba1a-7144-11e5-ba71-058fbc01cf0b', 27, 'maverick'),
 ('fd27bbbe-7144-11e5-ba71-058fbc01cf0b', 20, 'protodog'),
 ('fd27c1c2-7144-11e5-ba71-058fbc01cf0b', 20, 'einstein'),
 ('fd27c5be-7144-11e5-ba71-058fbc01cf0b', 20, 'socialite'),
 ('fd27c74e-7144-11e5-ba71-058fbc01cf0b', 14, None),
 ('fd27c7d0-7144-11e5-ba71-058fbc01cf0b', 20, 'socialite'),
 ('fd27c852-7144-11e5-ba71-058fbc01cf0b', 20, 'stargazer'),
 ('fd27c8d4-7144-11e5-ba71-058fbc01cf0b', 20, 'ace'),
 ('fd27c956-7144-11e5-ba71-058fbc01cf0b', 11, None),
 ('fd27cb72-7144-11e5-ba71-058fbc01cf0b', 20, 'protodog'),
 ('fd27cd98-7144-11e5-ba71-058fbc01cf0b', 20, 'expert'),
 ('fd27ce1a-7144-11e5-ba71-058fbc01cf0b', 7, None),
 ('fd27cea6-7144-11e5-ba71-058fbc01cf0b', 2, None),
 ('fd27cf28-7144-11e5-ba71-058fbc01cf0b', 20, 'charmer'),
 ('fd27cfaa-7144-11e5-ba71-058fbc01cf0b', 7, None),
 ('fd27d02c-7144-11e5-ba71-058fbc01cf0b', 20, 'stargazer'),
 ('fd27d0b8-7144-11e5-ba71-058fbc01cf0b', 21, 'renaissance-dog'),
 ('fd27d144-7144-11e5-ba71-058fbc01cf0b', 7, None),
 ('fd27d1c6-7144-11e5-ba71-058fbc01cf0b', 7, None),
 ('fd27d248-7144-11e5-ba71-058fbc01cf0b', 6, None),
 ('fd27d2ca-7144-11e5-ba71-058fbc01cf0b', 4, None),
 ('fd27d34c-7144-11e5-ba71-058fbc01cf0b', 4, None),
 ('fd27d3d8-7144-11e5-ba71-058fbc01cf0b', 4, None),
 ('fd27d45a-7144-11e5-ba71-058fbc01cf0b', 28, 'stargazer'),
 ('fd27d4dc-7144-11e5-ba71-058fbc01cf0b', 28, 'maverick'),
 ('fd27d770-7144-11e5-ba71-058fbc01cf0b', 25, 'socialite'),
 ('fd27d9fa-7144-11e5-ba71-058fbc01cf0b', 20, 'einstein'),
 ('fd27db08-7144-11e5-ba71-058fbc01cf0b', 14, None),
 ('fd27db8a-7144-11e5-ba71-058fbc01cf0b', 16, None),
 ('fd27dc52-7144-11e5-ba71-058fbc01cf0b', 2, None),
 ('fd27dd38-7144-11e5-ba71-058fbc01cf0b', 4, None),
 ('fd27e026-7144-11e5-ba71-058fbc01cf0b', 6, None),
 ('fd27e0d0-7144-11e5-ba71-058fbc01cf0b', 6, None),
 ('fd27e1e8-7144-11e5-ba71-058fbc01cf0b', 20, 'charmer'),
 ('fd27e31e-7144-11e5-ba71-058fbc01cf0b', 23, 'socialite'),
 ('fd27e454-7144-11e5-ba71-058fbc01cf0b', 45, 'maverick'),
 ('fd27e580-7144-11e5-ba71-058fbc01cf0b', 33, 'stargazer'),
 ('fd27e9a4-7144-11e5-ba71-058fbc01cf0b', 22, 'protodog'),
 ('fd27eae4-7144-11e5-ba71-058fbc01cf0b', 4, None),
 ('fd27ed46-7144-11e5-ba71-058fbc01cf0b', 25, 'maverick'),
 ('fd27efb2-7144-11e5-ba71-058fbc01cf0b', 20, 'einstein'),
 ('fd27f110-7144-11e5-ba71-058fbc01cf0b', 7, None),
 ('fd27f25a-7144-11e5-ba71-058fbc01cf0b', 6, None),
 ('fd27f4c6-7144-11e5-ba71-058fbc01cf0b', 4, None),
 ('fd27f732-7144-11e5-ba71-058fbc01cf0b', 4, None),
 ('fd27f868-7144-11e5-ba71-058fbc01cf0b', 4, None),
 ('fd27f9a8-7144-11e5-ba71-058fbc01cf0b', 3, None),
 ('fd28010a-7144-11e5-ba71-058fbc01cf0b', 2, None),
 ('fd280236-7144-11e5-ba71-058fbc01cf0b', 2, None),
 ('fd280344-7144-11e5-ba71-058fbc01cf0b', 6, None),
 ('fd280826-7144-11e5-ba71-058fbc01cf0b', 4, None),
 ('fd2808b2-7144-11e5-ba71-058fbc01cf0b', 11, None),
 ('fd28093e-7144-11e5-ba71-058fbc01cf0b', 2, None),
 ('fd2809c0-7144-11e5-ba71-058fbc01cf0b', 4, None),
 ('fd3ccd24-7144-11e5-ba71-058fbc01cf0b', 4, None),
 ('fd3ccf2c-7144-11e5-ba71-058fbc01cf0b', 22, 'einstein'),
 ('fd3cd40e-7144-11e5-ba71-058fbc01cf0b', 10, None),
 ('fd3cd4d6-7144-11e5-ba71-058fbc01cf0b', 20, 'charmer'),
 ('fd3cd8d2-7144-11e5-ba71-058fbc01cf0b', 7, None),
 ('fd3cd99a-7144-11e5-ba71-058fbc01cf0b', 20, 'renaissance-dog'),
 ('fd3cec50-7144-11e5-ba71-058fbc01cf0b', 4, None),
 ('fd3cf5c4-7144-11e5-ba71-058fbc01cf0b', 4, None),
 ('fd3cf678-7144-11e5-ba71-058fbc01cf0b', 7, None),
 ('fd3cf718-7144-11e5-ba71-058fbc01cf0b', 17, None),
 ('fd3cf8ee-7144-11e5-ba71-058fbc01cf0b', 20, 'protodog'),
 ('fd3cf984-7144-11e5-ba71-058fbc01cf0b', 4, None),
 ('fd3cfa1a-7144-11e5-ba71-058fbc01cf0b', 4, None),
 ('fd3cfab0-7144-11e5-ba71-058fbc01cf0b', 38, 'charmer'),
 ('fd3cfcfe-7144-11e5-ba71-058fbc01cf0b', 20, 'socialite'),
 ('fd3cfd94-7144-11e5-ba71-058fbc01cf0b', 20, 'expert'),
 ('fd3cfe2a-7144-11e5-ba71-058fbc01cf0b', 20, 'socialite'),
 ('fd3cfeb6-7144-11e5-ba71-058fbc01cf0b', 20, 'protodog'),
 ('fd3cff4c-7144-11e5-ba71-058fbc01cf0b', 21, 'charmer'),
 ('fd3d0078-7144-11e5-ba71-058fbc01cf0b', 10, None),
 ('fd3d01ae-7144-11e5-ba71-058fbc01cf0b', 11, None),
 ('fd3d03fc-7144-11e5-ba71-058fbc01cf0b', 4, None),
 ('fd3d0492-7144-11e5-ba71-058fbc01cf0b', 14, None),
 ('fd3d05be-7144-11e5-ba71-058fbc01cf0b', 11, None),
 ('fd3d064a-7144-11e5-ba71-058fbc01cf0b', 16, None),
 ('fd3d06e0-7144-11e5-ba71-058fbc01cf0b', 16, None),
 ('fd3d0776-7144-11e5-ba71-058fbc01cf0b', 20, 'einstein'),
 ('fd3d080c-7144-11e5-ba71-058fbc01cf0b', 4, None),
 ('fd3d0898-7144-11e5-ba71-058fbc01cf0b', 45, 'socialite'),
 ('fd3d0938-7144-11e5-ba71-058fbc01cf0b', 20, 'socialite'),
 ('fd3d09ce-7144-11e5-ba71-058fbc01cf0b', 20, 'ace'),
 ('fd3d0b7c-7144-11e5-ba71-058fbc01cf0b', 7, None),
 ('fd3d0c12-7144-11e5-ba71-058fbc01cf0b', 4, None),
 ('fd3d0cb2-7144-11e5-ba71-058fbc01cf0b', 5, None),
 ('fd3d0d48-7144-11e5-ba71-058fbc01cf0b', 20, 'expert'),
 ('fd3d0dde-7144-11e5-ba71-058fbc01cf0b', 14, None),
 ('fd3d0f00-7144-11e5-ba71-058fbc01cf0b', 20, 'expert'),
 ('fd3d0f96-7144-11e5-ba71-058fbc01cf0b', 20, 'socialite'),
 ('fd3d102c-7144-11e5-ba71-058fbc01cf0b', 20, 'charmer'),
 ('fd3d10cc-7144-11e5-ba71-058fbc01cf0b', 20, 'ace')]

**Question 3: Re-write the query in Question 2 using traditional join syntax (described in MySQL Exercise 8).**

In [ ]:
sql SELECT DISTINCT d.dog_guid,COUNT(c.created_at),COUNT(DISTINCT d.dimension),d.dimension\
    FROM dogs d,complete_tests c\
    WHERE d.dog_guid=c.dog_guid\
    GROUP BY d.dog_guid,d.dimension\
    ORDER BY d.dog_guid\
    LIMIT 10

Now we need to summarize the total number of tests completed by each unique DogID within each Dognition personality dimension.  To do this we will need to choose an appropriate aggregation function for the count column of the query we just wrote.  

**Question 4: To start, write a query that will output the average number of tests completed by unique dogs in each Dognition personality dimension.  Choose either the query in Question 2 or 3 to serve as an inner query in your main query.  If you have trouble, make sure you use the appropriate aliases in your GROUP BY and SELECT statements.**

In [18]:
sql SELECT d.dimension,AVG(numtests_per_dog.numtests)\
    FROM dogs d,\
        (SELECT d.dimension,d.dog_guid,COUNT(c.created_at) AS numtests\
          FROM dogs d JOIN complete_tests c\
            ON d.dog_guid=c.dog_guid\
         GROUP BY d.dog_guid) AS numtests_per_dog\
    GROUP BY numtests_per_dog.dimension\
    LIMIT 10

10 rows affected.

[('charmer', Decimal('6.9416')),
 ('charmer', Decimal('9.5352')),
 ('charmer', Decimal('23.3878')),
 ('charmer', Decimal('23.2594')),
 ('charmer', Decimal('23.2171')),
 ('charmer', Decimal('23.3926')),
 ('charmer', Decimal('22.8199')),
 ('charmer', Decimal('22.9336')),
 ('charmer', Decimal('23.0157')),
 ('charmer', Decimal('23.1194'))]

You should retrieve an output of 11 rows with one of the dimensions labeled "None" and another labeled "" (nothing is between the quotation marks).

**Question 5: How many unique DogIDs are summarized in the Dognition dimensions labeled "None" or ""? (You should retrieve values of 13,705 and 71)**

In [17]:
sql SELECT COUNT(DISTINCT d.dog_guid),d.dimension\
    FROM dogs d JOIN complete_tests c\
        ON d.dog_guid=c.dog_guid\
    WHERE d.dimension='' OR d.dimension IS NULL\
    GROUP BY d.dimension\

2 rows affected.

[(13705, None), (71, '')]

It makes sense there would be many dogs with NULL values in the dimension column, because we learned from Dognition that personality dimensions can only be assigned after the initial "Dognition Assessment" is completed, which is comprised of the first 20 Dognition tests.  If dogs did not complete the first 20 tests, they would retain a NULL value in the dimension column.

The non-NULL empty string values are more curious.  It is not clear where those values would come from.  

**Question 6: To determine whether there are any features that are common to all dogs that have non-NULL empty strings in the dimension column, write a query that outputs the breed, weight, value in the "exclude" column, first or minimum time stamp in the complete_tests table, last or maximum time stamp in the complete_tests table, and total number of tests completed by each unique DogID that has a non-NULL empty string in the dimension column.**

In [31]:
sql SELECT d.breed,d.weight,d.exclude,MIN(c.created_at),MAX(c.updated_at),COUNT(DISTINCT c.created_at)\
    FROM dogs d JOIN complete_tests c\
        ON d.dog_guid=c.dog_guid\
    WHERE d.dimension IS NOT NULL\
    GROUP BY  d.dog_guid\
    LIMIT 10

10 rows affected.

[('Labrador Retriever', 50, None, datetime.datetime(2013, 2, 10, 1, 14, 3), datetime.datetime(2014, 8, 28, 1, 45, 2), 21),
 ('Shetland Sheepdog', 20, None, datetime.datetime(2013, 2, 5, 22, 23, 49), datetime.datetime(2013, 2, 13, 18, 51, 54), 20),
 ('Shih Tzu', 190, 1, datetime.datetime(2013, 2, 5, 18, 26, 54), datetime.datetime(2013, 9, 25, 19, 6, 41), 31),
 ('Siberian Husky', 60, None, datetime.datetime(2013, 2, 5, 21, 58, 19), datetime.datetime(2013, 2, 9, 7, 24, 28), 20),
 ('Shih Tzu', 190, 1, datetime.datetime(2013, 2, 5, 20, 35, 47), datetime.datetime(2013, 7, 16, 19, 31, 28), 27),
 ('Mixed', 50, None, datetime.datetime(2013, 2, 5, 18, 57, 5), datetime.datetime(2013, 2, 5, 22, 38, 1), 20),
 ('Labrador Retriever', 70, None, datetime.datetime(2013, 2, 7, 4, 41, 21), datetime.datetime(2013, 2, 20, 4, 38, 27), 20),
 ('Shih Tzu-Poodle Mix', 0, None, datetime.datetime(2013, 2, 5, 21, 44, 38), datetime.datetime(2013, 2, 10, 3, 33, 37), 20),
 ('Vizsla', 60, None, datetime.datetime(2013, 2, 6, 3, 55, 52), datetime.datetime(2013, 2, 6, 6, 23), 20),
 ('Pug', 20, None, datetime.datetime(2013, 2, 5, 23, 35, 48), datetime.datetime(2013, 2, 6, 23, 5, 10), 20)]

A quick inspection of the output from the last query illustrates that almost all of the entries that have non-NULL empty strings in the dimension column also have "exclude" flags of 1, meaning that the entries are meant to be excluded due to factors monitored by the Dognition team.  This provides a good argument for excluding the entire category of entries that have non-NULL empty strings in the dimension column from our analyses.

**Question 7: Rewrite the query in Question 4 to exclude DogIDs with (1) non-NULL empty strings in the dimension column, (2) NULL values in the dimension column, and (3) values of "1" in the exclude column.  NOTES AND HINTS: You cannot use a clause that says d.exclude does not equal 1 to remove rows that have exclude flags, because Dognition clarified that both NULL values and 0 values in the "exclude" column are valid data.  A clause that says you should only include values that are not equal to 1 would remove the rows that have NULL values in the exclude column, because NULL values are never included in equals statements (as we learned in the join lessons).  In addition, although it should not matter for this query, practice including parentheses with your OR and AND statements that accurately reflect the logic you intend.  Your results should return 402 DogIDs in the ace dimension and 626 dogs in the charmer dimension.**

In [37]:
## Question 4: To start, write a query that will output the average number of tests\
##completed by unique dogs in each Dognition personality dimension.
## Choose either the query in Question 2 or 3 to serve as an inner query in your main query. If you have trouble, make sure you use the appropriate aliases in your GROUP BY and SELECT statements.

In [36]:
sql SELECT dimension_per_dog.dimension,AVG(dimension_per_dog.number)\
    FROM (SELECT d.dog_guid AS dogID,d.dimension AS dimension,COUNT(c.created_at) AS number\
          FROM dogs d JOIN complete_tests c\
              ON d.dog_guid = c.dog_guid\
          WHERE d.dog_guid IS NOT NULL AND d.dog_guid!='' AND\
          d.dimension IS NOT NULL AND d.dimension!='' AND d.exclude!='0' AND d.exclude IS NOT NULL\
          GROUP BY d.dog_guid) AS dimension_per_dog\
    GROUP BY dimension_per_dog.dimension

9 rows affected.

[('ace', Decimal('22.7333')),
 ('charmer', Decimal('22.2813')),
 ('einstein', Decimal('23.1000')),
 ('expert', Decimal('23.0400')),
 ('maverick', Decimal('23.2963')),
 ('protodog', Decimal('22.7463')),
 ('renaissance-dog', Decimal('22.7660')),
 ('socialite', Decimal('23.3165')),
 ('stargazer', Decimal('22.3725'))]

The results of Question 7 suggest there are not appreciable differences in the number of tests completed by dogs with different Dognition personality dimensions.  Although these analyses are not definitive on their own, these results suggest focusing on Dognition personality dimensions will not likely lead to significant insights about how to improve Dognition completion rates.



## 2. Assess whether dog breeds are related to the number of tests completed

The next variable in the Dognition sPAP we want to investigate is Dog Breed.  We will run one analysis with Breed Group and one analysis with Breed Type.

First, determine how many distinct breed groups there are.

**Questions 8: Write a query that will output all of the distinct values in the breed_group field.**

In [38]:
sql SELECT DISTINCT d.breed_type\
    FROM dogs d

4 rows affected.

[('Pure Breed',),
 ("Mixed Breed/ Other/ I Don't Know",),
 ('Cross Breed',),
 ('Popular Hybrid',)]

You can see that there are NULL values in the breed_group field.  Let's examine the properties of these entries with NULL values to determine whether they should be excluded from our analysis.


**Question 9: Write a query that outputs the breed, weight, value in the "exclude" column, first or minimum time stamp in the complete_tests table, last or maximum time stamp in the complete_tests table, and total number of tests completed by each unique DogID that has a NULL value in the breed_group column.**

In [40]:
sql SELECT d.breed,d.weight,d.exclude,MIN(c.created_at),MAX(c.updated_at),COUNT(c.created_at)\
    FROM dogs d JOIN complete_tests c\
        ON d.dog_guid=c.dog_guid\
    WHERE d.breed_group IS NULL\
    GROUP BY d.dog_guid\
    LIMIT 10

10 rows affected.

[('Mixed', 50, None, datetime.datetime(2013, 2, 5, 18, 57, 5), datetime.datetime(2013, 2, 5, 22, 38, 1), 20),
 ('Shih Tzu-Poodle Mix', 0, None, datetime.datetime(2013, 2, 5, 21, 44, 38), datetime.datetime(2013, 2, 10, 3, 33, 37), 20),
 ('German Shepherd Dog-Pembroke Welsh Corgi Mix', 40, None, datetime.datetime(2013, 2, 6, 4, 45, 28), datetime.datetime(2014, 1, 6, 5, 58, 13), 14),
 ('German Shepherd Dog-Nova Scotia Duck Tolling Retriever Mix', 30, None, datetime.datetime(2013, 5, 17, 17, 45, 46), datetime.datetime(2013, 6, 14, 23, 42, 53), 11),
 ('Mixed', 10, None, datetime.datetime(2013, 2, 6, 4, 44, 50), datetime.datetime(2013, 2, 6, 4, 48, 29), 2),
 ('Australian Shepherd-German Shepherd Dog Mix', 90, None, datetime.datetime(2013, 2, 7, 5, 15, 48), datetime.datetime(2013, 12, 20, 21, 3, 18), 21),
 ('Golden Doodle', 70, None, datetime.datetime(2013, 2, 9, 5, 49, 46), datetime.datetime(2013, 2, 9, 6, 10, 11), 6),
 ('Mixed', 30, None, datetime.datetime(2013, 2, 10, 3, 28, 12), datetime.datetime(2013, 7, 20, 2, 12, 37), 28),
 ('Mixed', 90, 1, datetime.datetime(2014, 9, 24, 15, 10, 3), datetime.datetime(2014, 9, 24, 21, 23, 37), 20),
 ('Mudi', 20, None, datetime.datetime(2014, 10, 6, 22, 21, 56), datetime.datetime(2014, 10, 6, 22, 24, 2), 2)]

There are a lot of these entries and there is no obvious feature that is common to all of them, so at present, we do not have a good reason to exclude them from our analysis.  Therefore, let's move on to question 10 now....


**Question 7: Rewrite the query in Question 4 to exclude DogIDs with (1) non-NULL empty strings in the dimension column, (2) NULL values in the dimension column, and (3) values of "1" in the exclude column.  NOTES AND HINTS: You cannot use a clause that says d.exclude does not equal 1 to remove rows that have exclude flags, because Dognition clarified that both NULL values and 0 values in the "exclude" column are valid data.  A clause that says you should only include values that are not equal to 1 would remove the rows that have NULL values in the exclude column, because NULL values are never included in equals statements (as we learned in the join lessons).  In addition, although it should not matter for this query, practice including parentheses with your OR and AND statements that accurately reflect the logic you intend.  Your results should return 402 DogIDs in the ace dimension and 626 dogs in the charmer dimension.**

**Question 10: Adapt the query in Question 7 to examine the relationship between breed_group and number of tests completed.  Exclude DogIDs with values of "1" in the exclude column. Your results should return 1774 DogIDs in the Herding breed group.**

In [45]:
sql SELECT breed_group,AVG(number_per_dog.number),COUNT(DISTINCT dogID)\
    FROM (SELECT d.breed_group AS breed_group,COUNT(c.created_at) AS number,d.dog_guid AS dogID\
          FROM dogs d JOIN complete_tests c\
              ON d.dog_guid=c.dog_guid\
          WHERE d.exclude='0' OR d.exclude IS NULL\
          GROUP BY d.dog_guid) AS number_per_dog\
    GROUP BY breed_group

9 rows affected.

[(None, Decimal('10.2251'), 8564),
 ('', Decimal('19.7542'), 179),
 ('Herding', Decimal('11.2469'), 1774),
 ('Hound', Decimal('10.0603'), 564),
 ('Non-Sporting', Decimal('10.0197'), 964),
 ('Sporting', Decimal('10.9915'), 2470),
 ('Terrier', Decimal('9.9333'), 780),
 ('Toy', Decimal('8.7157'), 1041),
 ('Working', Decimal('10.2358'), 865)]

In [50]:
sql SELECT d.breed_group,COUNT(DISTINCT d.dog_guid)\
    FROM dogs d JOIN complete_tests c\
        ON d.dog_guid=c.dog_guid\
    WHERE d.exclude='0' OR d.exclude IS NULL\
    GROUP BY d.breed_group

9 rows affected.

[(None, 8564),
 ('', 179),
 ('Herding', 1774),
 ('Hound', 564),
 ('Non-Sporting', 964),
 ('Sporting', 2470),
 ('Terrier', 780),
 ('Toy', 1041),
 ('Working', 865)]

The results show there are non-NULL entries of empty strings in breed_group column again.  Ignoring them for now, Herding and Sporting breed_groups complete the most tests, while Toy breed groups complete the least tests.  This suggests that one avenue an analyst might want to explore further is whether it is worth it to target marketing or certain types of Dognition tests to dog owners with dogs in the Herding and Sporting breed_groups.  Later in this lesson we will discuss whether using a median instead of an average to summarize the number of completed tests might affect this potential course of action. 

**Question 11: Adapt the query in Question 10 to only report results for Sporting, Hound, Herding, and Working breed_groups using an IN clause.**

In [ ]:
sql SELECT breed_group,AVG(number_per_dog.number),COUNT(DISTINCT dogID)\
    FROM (SELECT d.breed_group AS breed_group,COUNT(c.created_at) AS number,d.dog_guid AS dogID\
          FROM dogs d JOIN complete_tests c\
              ON d.dog_guid=c.dog_guid\
          WHERE d.exclude='0' OR d.exclude IS NULL\
          GROUP BY d.dog_guid) AS number_per_dog\
    GROUP BY breed_group\
    HAVING breed_group IN ('sporting','hound','herding','working')

Next, let's examine the relationship between breed_type and number of completed tests.  

**Questions 12: Begin by writing a query that will output all of the distinct values in the breed_type field.**

In [51]:
sql SELECT DISTINCT breed_type\
    FROM dogs

4 rows affected.

[('Pure Breed',),
 ("Mixed Breed/ Other/ I Don't Know",),
 ('Cross Breed',),
 ('Popular Hybrid',)]

**Question 13: Adapt the query in Question 7 to examine the relationship between breed_type and number of tests completed. Exclude DogIDs with values of "1" in the exclude column. Your results should return 8865 DogIDs in the Pure Breed group.**

In [52]:
sql SELECT breed_type,AVG(number_per_dog.number),COUNT(DISTINCT dogID)\
    FROM (SELECT d.breed_type AS breed_type,d.dog_guid AS dogID,COUNT(c.created_at) AS number\
         FROM dogs d JOIN complete_tests c\
             ON d.dog_guid=c.dog_guid\
         WHERE d.exclude='0'OR d.exclude IS NULL\
         GROUP BY dogID) AS number_per_dog\
    GROUP BY breed_type

4 rows affected.

[('Cross Breed', Decimal('10.6009'), 2884),
 ("Mixed Breed/ Other/ I Don't Know", Decimal('10.2688'), 4818),
 ('Popular Hybrid', Decimal('10.8423'), 634),
 ('Pure Breed', Decimal('10.4107'), 8865)]

There does not appear to be an appreciable difference between number of tests completed by dogs of different breed types.
    
  
## 3. Assess whether dog breeds and neutering are related to the number of tests completed

To explore the results we found above a little further, let's run some queries that relabel the breed_types according to "Pure_Breed" and "Not_Pure_Breed".  

**Question 14: For each unique DogID, output its dog_guid, breed_type, number of completed tests, and use a CASE statement to include an extra column with a string that reads "Pure_Breed" whenever breed_type equals 'Pure Breed" and "Not_Pure_Breed" whenever breed_type equals anything else.  LIMIT your output to 50 rows for troubleshooting.**

In [64]:
sql SELECT DISTINCT d.dog_guid,d.breed_type,d.total_tests_completed,\
    CASE d.breed_type\
        WHEN 'pure breed' THEN 'Pure_breed'\
        ELSE 'not_pure_breed'\
    END AS purebreed\
    FROM dogs d\
    LIMIT 10

10 rows affected.

[('fd27b272-7144-11e5-ba71-058fbc01cf0b', 'Pure Breed', '21', 'Pure_breed'),
 ('fd27b5ba-7144-11e5-ba71-058fbc01cf0b', 'Pure Breed', '20', 'Pure_breed'),
 ('fd27b6b4-7144-11e5-ba71-058fbc01cf0b', 'Pure Breed', '2', 'Pure_breed'),
 ('fd27b79a-7144-11e5-ba71-058fbc01cf0b', 'Pure Breed', '11', 'Pure_breed'),
 ('fd27b86c-7144-11e5-ba71-058fbc01cf0b', 'Pure Breed', '31', 'Pure_breed'),
 ('fd27b948-7144-11e5-ba71-058fbc01cf0b', 'Pure Breed', '20', 'Pure_breed'),
 ('fd27ba1a-7144-11e5-ba71-058fbc01cf0b', 'Pure Breed', '27', 'Pure_breed'),
 ('fd27bbbe-7144-11e5-ba71-058fbc01cf0b', "Mixed Breed/ Other/ I Don't Know", '20', 'not_pure_breed'),
 ('fd27c1c2-7144-11e5-ba71-058fbc01cf0b', 'Pure Breed', '20', 'Pure_breed'),
 ('fd27c5be-7144-11e5-ba71-058fbc01cf0b', 'Cross Breed', '20', 'not_pure_breed')]

**Question 15: Adapt your queries from Questions 7 and 14 to examine the relationship between breed_type and number of tests completed by Pure_Breed dogs and non_Pure_Breed dogs.  Your results should return 8336 DogIDs in the Not_Pure_Breed group.**

In [74]:
sql SELECT purebreed, AVG(number_per_dog.number),COUNT(DISTINCT dogID)\
    FROM (SELECT COUNT(c.created_at) AS number,d.dog_guid AS dogID,\
          CASE d.breed_type\
              WHEN 'Pure Breed' THEN 'pure_breed'\
              ELSE 'not_pure_breed'\
          END AS purebreed\
          FROM dogs d JOIN complete_tests c\
              ON d.dog_guid=c.dog_guid\
          WHERE d.exclude='0' OR d.exclude IS NULL\
          GROUP BY d.dog_guid) AS number_per_dog\
    GROUP BY purebreed\
    LIMIT 10

2 rows affected.

[('not_pure_breed', Decimal('10.4273'), 8336),
 ('pure_breed', Decimal('10.4107'), 8865)]

**Question 16: Adapt your query from Question 15 to examine the relationship between breed_type, whether or not a dog was neutered (indicated in the dog_fixed field), and number of tests completed by Pure_Breed dogs and non_Pure_Breed dogs. There are DogIDs with null values in the dog_fixed column, so your results should have 6 rows, and the average number of tests completed by non-pure-breeds who are neutered is 10.5681.**

In [79]:
sql SELECT purebreed, AVG(number_per_dog.number),COUNT(DISTINCT dogID),neutered\
    FROM (SELECT COUNT(c.created_at) AS number,d.dog_guid AS dogID,\
          CASE d.dog_fixed\
              WHEN '1' THEN 'neutered'\
              WHEN '0' THEN 'not neutered'\
              ELSE 'NULL'\
          END AS neutered,\
          CASE d.breed_type\
              WHEN 'Pure Breed' THEN 'pure_breed'\
              ELSE 'not_pure_breed'\
          END AS purebreed\
          FROM dogs d JOIN complete_tests c\
              ON d.dog_guid=c.dog_guid\
          WHERE d.exclude='0' OR d.exclude IS NULL\
          GROUP BY d.dog_guid) AS number_per_dog\
    GROUP BY purebreed,neutered\
    LIMIT 10

6 rows affected.

[('not_pure_breed', Decimal('10.5681'), 7647, 'neutered'),
 ('not_pure_breed', Decimal('8.6807'), 592, 'not neutered'),
 ('not_pure_breed', Decimal('9.9897'), 97, 'NULL'),
 ('pure_breed', Decimal('10.6987'), 7043, 'neutered'),
 ('pure_breed', Decimal('9.3788'), 1687, 'not neutered'),
 ('pure_breed', Decimal('8.2815'), 135, 'NULL')]

These results suggest that although a dog's breed_type doesn't seem to have a strong relationship with how many tests a dog completed, neutered dogs, on average, seem to finish 1-2 more tests than non-neutered dogs.  It may be fruitful to explore further whether this effect is consistent across different segments of dogs broken up according to other variables.  If the effects are consistent, the next step would be to seek evidence that could clarify whether neutered dogs are finishing more tests due to traits that arise when a dog is neutered, or instead, whether owners who are more likely to neuter their dogs have traits that make it more likely they will want to complete more tests.


## 4. Other dog features that might be related to the number of tests completed, and a note about using averages as summary metrics

Two other dog features included in our sPAP were speed of game completion and previous behavioral training.  Examing the relationship between the speed of game completion and number of games completed is best achieved through creating a scatter plot with a best fit line and/or running a statistical regression analysis.  It is possible to achieve the statistical regression analysis through very advanced SQL queries, but the strategy that would be required is outside the scope of this course.  Therefore, I would recommend exporting relevant data to a program like Tableau, R, or Matlab in order to assess the relationship between the speed of game completion and number of games completed.  

Unfortunately, there is no field available in the Dognition data that is relevant to a dog's previous behavioral training, so more data would need to be collected to examine whether previous behavioral training is related to the number of Dognition tests completed.

One last issue I would like to address in this lesson is the issue of whether an average is a good summary to use to represent the values of a certain group.  Average calculations are very sensitive to extreme values, or outliers, in the data.  This video provides a nice demonstration of how sensitive averages can be:

http://www.statisticslectures.com/topics/outliereffects/

Ideally, you would summarize the data in a group using a median calculation when you either don't know the distribution of values in your data or you already know that outliers are present (the definition of median is covered in the video above).  Unfortunately, medians are more computationally intensive than averages, and there is no pre-made function that allows you to calculate medians using SQL.  If you wanted to calculate the median, you would need to use an advanced strategy such as the ones described here:

https://www.periscopedata.com/blog/medians-in-sql.html

Despite the fact there is no simple way to calculate medians using SQL, there is a way to get a hint about whether average values are likely to be wildly misleading.  As described in the first video (http://www.statisticslectures.com/topics/outliereffects/), strong outliers lead to large standard deviation values.  Fortunately, we *CAN* calculate standard deviations in SQL easily using the STDDEV function.  Therefore, it is good practice to include standard deviation columns with your outputs so that you have an idea whether the average values outputted by your queries are trustworthy.  Whenever standard deviations are a significant portion of the average values of a field, and certainly when standard deviations are larger than the average values of a field, it's a good idea to export your data to a program that can handle more sophisticated statistical analyses before you interpret any results too strongly.  

Let's practice including standard deviations in our queries and interpretting their values.

**Question 17: Adapt your query from Question 7 to include a column with the standard deviation for the number of tests completed by each Dognition personality dimension.**

In [19]:
sql SELECT dimension,AVG(number_per_dog.number),STDDEV(number_per_dog.number),COUNT(DISTINCT dogID)\
    FROM (SELECT d.dimension AS dimension,COUNT(c.created_at) AS number,d.dog_guid AS dogID\
          FROM dogs d JOIN complete_tests c\
              ON d.dog_guid=c.dog_guid\
          WHERE d.exclude='0' OR d.exclude IS NULL\
          GROUP BY d.dog_guid) AS number_per_dog\
    GROUP BY dimension

11 rows affected.

[(None, Decimal('6.8633'), 4.838, 13437),
 ('', Decimal('11.0000'), 5.831, 9),
 ('ace', Decimal('23.5100'), 5.4896, 402),
 ('charmer', Decimal('23.3594'), 5.1919, 626),
 ('einstein', Decimal('23.2385'), 5.3155, 109),
 ('expert', Decimal('23.4249'), 4.7589, 273),
 ('maverick', Decimal('22.7673'), 4.7353, 245),
 ('protodog', Decimal('22.9570'), 5.3742, 535),
 ('renaissance-dog', Decimal('23.0410'), 4.9508, 463),
 ('socialite', Decimal('23.0997'), 4.9748, 792),
 ('stargazer', Decimal('22.7968'), 4.8254, 310)]

The standard deviations are all around 20-25% of the average values of each personality dimension, and they are not appreciably different across the personality dimensions, so the average values are likely fairly trustworthy.  Let's try calculating the standard deviation of a different measurement.

**Question 18: Write a query that calculates the average amount of time it took each dog breed_type to complete all of the tests in the exam_answers table. Exclude negative durations from the calculation, and include a column that calculates the standard deviation of durations for each breed_type group:**

In [22]:
sql SELECT AVG(time_per_dog.timediff),STDDEV(time_per_dog.timediff)\
    FROM (SELECT d.breed_type AS breedtype,TIMESTAMPDIFF(MINUTE,e.start_time,e.end_time) AS timediff\
         FROM exam_answers e JOIN dogs d\
             ON e.dog_guid=d.dog_guid\
          WHERE TIMESTAMPDIFF(minute,e.start_time,e.end_time)>0) AS time_per_dog\
    GROUP BY time_per_dog.breedtype

4 rows affected.

[(Decimal('11810.3230'), 59113.4558),
 (Decimal('9145.1575'), 48748.6268),
 (Decimal('7734.0763'), 45577.6582),
 (Decimal('12311.2558'), 60997.3543)]

In [20]:
sql SELECT d.breed_type,AVG(TIMESTAMPDIFF(MINUTE,e.start_time,e.end_time)),STDDEV(TIMESTAMPDIFF(MINUTE,e.start_time,e.end_time))\
    FROM exam_answers e JOIN dogs d\
        ON e.dog_guid=d.dog_guid\
    WHERE TIMESTAMPDIFF(MINUTE,e.start_time,e.end_time)>0\
    GROUP BY d.breed_type

4 rows affected.

[('Cross Breed', Decimal('11810.3230'), 59113.4558),
 ("Mixed Breed/ Other/ I Don't Know", Decimal('9145.1575'), 48748.6268),
 ('Popular Hybrid', Decimal('7734.0763'), 45577.6582),
 ('Pure Breed', Decimal('12311.2558'), 60997.3543)]

This time many of the standard deviations have larger magnitudes than the average duration values.  This suggests  there are outliers in the data that are significantly impacting the reported average values, so the average values are not likely trustworthy. These data should be exported to another program for more sophisticated statistical analysis.

**In the next lesson, we will write queries that assess the relationship between testing circumstances and the number of tests completed.  Until then, feel free to practice any additional queries you would like to below!**